[{"company":"MAKEMUSIC (A PEAKSWARE COMPANY)","description":"Come be a part of the team transforming music technology! MakeMusic has an opening for a Frontend Software Engineer in our…","title":"Software Engineer, Frontend"},{"company":"BOMBBOMB","description":"At BombBomb, we are passionate about building relationships. We have a vision of connecting people to one another and humanizing the planet. All of ou…","title":"Devops Engineer"},{"company":"THOUGHTWORKS","description":"Our developers have been contributing code to major organizations and open source projects for over 25 years now. They’ve also been writing book…","title":"Lead Developer"},{"company":"VENDAVO","description":"  Vendavo is seeking a Senior .NET Web Developer in Denver as part of a growing team focused on our cloud hosted Configure Price Quote (CPQ) p…","title":".NET Web Developer"},{"company":"HAVENLY","description":"Havenly is looking for a VP of Engineering; a leader, someone who will oversee the engineering organization and help evolve the Havenly product and se…","title":"VP, Engineering"},{"company":"HEALTHGRADES","description":"Healthgrades is seeking a Security Engineer to join our team in downtown Denver. Are you looking for a company where you can grow and make a differenc…","title":"Security Engineer"},{"company":"BombBomb","description":"At BombBomb, we are passionate about building relationships. We have a vision of connecting people to one another and humanizing the planet. All of ou…","title":"Devops Engineer"},{"company":"FOUR WINDS INTERACTIVE","description":"Overview Four Winds Interactive seeks a Software Developer to work with the product development team. This position will serve as the JavaScript De…","title":"Software Developer (JavaScript)"},{"company":"ARROW ELECTRONICS, INC.","description":"Job Description: Senior Web Developer, Full Stack   As our newest team member, you will be a part of implementing innovations on our eCo…","title":"Web Developer"},{"company":"TRAININGPEAKS (A PEAKSWARE COMPANY)","description":"Junior Software Engineer Our founders had a dream where a few dedicated engineers went off to an amazing space in RiNo with the sole purpose of cre…","title":"Junior Software Engineer"},{"company":"IHS MARKIT DIGITAL","description":"About IHS Markit IHS Markit harnesses deep sources of information, analytics and expertise to forge solutions for the industries and markets that d…","title":"Development Manager"},{"company":"BILLTRUST","description":"Overview It's not just cliché. The heart of Billtrust is its people. Our executives know it, our co-workers believe it, and our clients recognize i…","title":"Implementations Solutions Architect"},{"company":"MakeMusic (A Peaksware Company)","description":"Come be a part of the team transforming music technology!\nMakeMusic has an opening for a Frontend Software Engineer in our…","title":"Software Engineer, Frontend"},{"company":"MAKEMUSIC (A PEAKSWARE COMPANY)","description":"Join our open and collaborative environment using lean agile software development processes and methodologies. Drive technology and solutions that tac…","title":"Software Engineer, Backend"},{"company":"FINFOLIO","description":"FinFolio is a boutique technology company that makes software for professional financial advisers. We're seeking someone who wants to work in financia…","title":"Full Stack C#/SQL/React Developer"},{"company":"CONGA","description":"Company Description Conga’s suite of solutions creates more efficient organizations by simplifying and automating data, documents, contracts and re…","title":"Senior Software Development Engineer"},{"company":"BILLTRUST","description":"Overview It's not just cliché. The heart of Billtrust is its people. Our executives know it, our co-workers believe it, and our clients recognize i…","title":"Implementations Solutions Analyst"},{"company":"EMS SOFTWARE","description":"EMS Software is looking for a Cloud Operations Engineer who will aid us in the ongoing transformation of our product offering from an on-premise solut…","title":"Cloud Operations Engineer"},{"company":"TRAININGPEAKS (A PEAKSWARE COMPANY)","description":"TrainingPeaks provides the complete web, mobile and desktop solution for enabling smart and effective endurance training. Our products include Tr…","title":"Director of Software Engineering"},{"company":"ARROW ELECTRONICS, INC.","description":"Job Description: Our newest team member will be responsible for designing solutions to business requirements and implementing them using configurat…","title":"Microsoft Dynamics NAV Senior Developer"},{"company":"ARROW ELECTRONICS, INC.","description":"Job Description: Our newest team member will be responsible for the design, implementation and maintenance of our continuous integration/continuous…","title":"DevOps Engineer"},{"company":"ZAYO GROUP","description":"Junior Application Developer                                  …","title":"Junior Application Developer"},{"company":"ADEPTIVE SOFTWARE","description":"ABOUT ADEPTIVE SOFTWARE Adeptive is one of the fastest growing companies in the title and escrow software market, thanks to the continued strong ad…","title":"Software Engineer"}]